* Program for cerner_2^5_2020 
* Finding fibo
IDENTIFICATION DIVISION.
PROGRAM-ID. SAVAGE_FIBO.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-LIMIT     PIC 9(2).
    01 WS-NUMA      PIC 9(3).
    01 WS-NUMB      PIC 9(3).
    01 WS-NUMC      PIC 9(3).
PROCEDURE DIVISION.
ACCEPT WS-LIMIT
MOVE 1 TO WS-NUMA
MOVE 1 TO WS-NUMB
MOVE 1 TO WS-NUMC
DISPLAY WS-NUMA
DISPLAY WS-NUMB
* cerner_2^5_2020
PERFORM UNTIL WS-LIMIT<1

    COMPUTE WS-NUMC=WS-NUMA + WS-NUMB
    END-COMPUTE
    MOVE WS-NUMB TO WS-NUMA
    MOVE WS-NUMC TO WS-NUMB
    DISPLAY WS-NUMC
    COMPUTE WS-LIMIT= WS-LIMIT - 1 
    END-COMPUTE

END-PERFORM
STOP RUN.